IOsonata/IOsonata/ARM/Nordic/nRF54/src/usbd_ctrlr_nrf54.c
	s_Ctrlr.FifoTop = (uint16_t)(s_Ctrlr.FifoTop - words);
	s_Ctrlr.TxFifoWords[EpNum] = words;

	uint32_t value = ((uint32_t)words << 16) | s_Ctrlr.FifoTop;
	if (EpNum == 0U)
	{
		NRF54_USBD_GNPTXFSIZ = value;
	}
	else
	{
		NRF54_USBD_DIEPTXF(EpNum) = value;
	}

	return true;
}

static bool nRF54UsbdGrowRxFifo(uint16_t Mps)
{
	uint16_t words = nRF54UsbdRxWords(Mps);

	if (words <= s_Ctrlr.RxWords)
	{
		return true;
	}

	if (words > s_Ctrlr.FifoTop)
	{
		return false;
	}

	s_Ctrlr.RxWords = words;
	NRF54_USBD_GRXFSIZ = words;
	return true;
}

static uint32_t nRF54UsbdEpType(uint8_t Type)
{
	switch (Type)
	{
		case USB_ENDPATT_TRANS_BULK:
			return 2UL;

		case USB_ENDPATT_TRANS_INT:
			return 3UL;

		default:
			return 0UL;
	}
}

static bool nRF54UsbdDisableEndpoint(uint8_t EpAddr, bool Stall)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	if (epNum >= NRF54_USBD_EP_COUNT)
	{
		return false;
	}

	const uint32_t stall = Stall ? NRF54_USBD_DEPCTL_STALL : 0U;

	if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		uint32_t ctl = NRF54_USBD_DIEPCTL(epNum);

		if ((ctl & NRF54_USBD_DEPCTL_EPENA) != 0U)
		{
			NRF54_USBD_DIEPCTL(epNum) = ctl | NRF54_USBD_DEPCTL_SNAK;
			if (!nRF54UsbdWaitSet(&NRF54_USBD_DIEPINT(epNum),
								 NRF54_USBD_DIEPINT_INEPNAKEFF))
			{
				return false;
			}

			NRF54_USBD_DIEPCTL(epNum) |=
				NRF54_USBD_DEPCTL_EPDIS | stall;
			if (!nRF54UsbdWaitSet(&NRF54_USBD_DIEPINT(epNum),
								 NRF54_USBD_DIEPINT_EPDISBLD))
			{
				return false;
			}

			NRF54_USBD_DIEPINT(epNum) =
				NRF54_USBD_DIEPINT_EPDISBLD |
				NRF54_USBD_DIEPINT_INEPNAKEFF;
		}
		else
		{
			NRF54_USBD_DIEPCTL(epNum) =
				ctl | NRF54_USBD_DEPCTL_SNAK | stall;
		}

		if (epNum != 0U && !nRF54UsbdFlushTx(epNum))
		{
			return false;
		}

		if (!Stall && epNum != 0U)
		{
			NRF54_USBD_DIEPCTL(epNum) &= ~NRF54_USBD_DEPCTL_USBACTEP;
		}

		return true;
	}

	uint32_t ctl = NRF54_USBD_DOEPCTL(epNum);
	if (epNum == 0U)
	{
		if (Stall)
		{
			NRF54_USBD_DOEPCTL(0) = ctl | NRF54_USBD_DEPCTL_STALL;
		}
		return true;
	}

	if ((ctl & NRF54_USBD_DEPCTL_EPENA) != 0U)
	{
		NRF54_USBD_DCTL |= NRF54_USBD_DCTL_SGOUTNAK;
		if (!nRF54UsbdWaitSet(&NRF54_USBD_GINTSTS,
							 NRF54_USBD_GINTSTS_GOUTNAKEFF))
		{
			NRF54_USBD_DCTL |= NRF54_USBD_DCTL_CGOUTNAK;
			return false;
		}

		NRF54_USBD_DOEPCTL(epNum) |= NRF54_USBD_DEPCTL_EPDIS | stall;
		if (!nRF54UsbdWaitSet(&NRF54_USBD_DOEPINT(epNum),
							 NRF54_USBD_DOEPINT_EPDISBLD))
		{
			NRF54_USBD_DCTL |= NRF54_USBD_DCTL_CGOUTNAK;
			return false;
		}

		NRF54_USBD_DOEPINT(epNum) = NRF54_USBD_DOEPINT_EPDISBLD;
		NRF54_USBD_DCTL |= NRF54_USBD_DCTL_CGOUTNAK;
	}
	else
	{
		NRF54_USBD_DOEPCTL(epNum) =
			ctl | NRF54_USBD_DEPCTL_SNAK | stall;
	}

	if (!Stall)
	{
		NRF54_USBD_DOEPCTL(epNum) &= ~NRF54_USBD_DEPCTL_USBACTEP;
	}

	return true;
}

static bool nRF54UsbdStartEp0Chunk(uint8_t EpAddr)
{
	nRF54UsbdXfer_t *pXfer = nRF54UsbdGetXfer(EpAddr);
	const uint16_t remaining =
		(uint16_t)(pXfer->TotalLen - pXfer->ActualLen);
	const uint16_t chunk = remaining < NRF54_USBD_EP0_MPS ?
		remaining : NRF54_USBD_EP0_MPS;

	pXfer->ChunkLen = chunk;

	if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		if (chunk > 0U)
		{
			memcpy(s_Ep0Bounce, pXfer->pBuffer + pXfer->ActualLen, chunk);
		}

		NRF54_USBD_DIEPDMA(0) = (uint32_t)(uintptr_t)s_Ep0Bounce;
		NRF54_USBD_DIEPTSIZ(0) =
			chunk | (1UL << NRF54_USBD_DIEPTSIZ0_PKTCNT_Pos);
		NRF54_USBD_DIEPCTL(0) |=
			NRF54_USBD_DEPCTL_CNAK | NRF54_USBD_DEPCTL_EPENA;
	}
	else
	{
		NRF54_USBD_DOEPDMA(0) = (uint32_t)(uintptr_t)s_Ep0Bounce;
		NRF54_USBD_DOEPTSIZ(0) =
			chunk | (1UL << NRF54_USBD_DOEPTSIZ0_PKTCNT_Pos);
		NRF54_USBD_DOEPCTL(0) |=
			NRF54_USBD_DEPCTL_CNAK | NRF54_USBD_DEPCTL_EPENA;
	}

	return true;
}

static void nRF54UsbdCompleteEp0(uint8_t EpAddr)
{
	nRF54UsbdXfer_t *pXfer = nRF54UsbdGetXfer(EpAddr);
	if (!pXfer->Started)
	{
		return;
	}

	const uint16_t chunk = pXfer->ChunkLen;

	if (!USB_ENDPADDR_IS_IN(EpAddr) && chunk > 0U)
	{
		const uint16_t left =
			(uint16_t)(NRF54_USBD_DOEPTSIZ(0) &
						   NRF54_USBD_DOEPTSIZ0_XFERSIZE_Msk);
		const uint16_t received = left < chunk ?
			(uint16_t)(chunk - left) : 0U;

		if (received > 0U)
		{
			memcpy(pXfer->pBuffer + pXfer->ActualLen,
				   s_Ep0Bounce, received);
		}
		pXfer->ActualLen = (uint16_t)(pXfer->ActualLen + received);

		if (received < chunk)
		{
			pXfer->Started = false;
			nRF54UsbdEmitXfer(EpAddr, pXfer->ActualLen,
							 USBD_CTRLR_XFER_SUCCESS);
			return;
		}
	}
	else
	{
		pXfer->ActualLen = (uint16_t)(pXfer->ActualLen + chunk);
	}

	if (pXfer->ActualLen < pXfer->TotalLen)
	{
		(void)nRF54UsbdStartEp0Chunk(EpAddr);
		return;
	}

	const uint16_t total = pXfer->ActualLen;
	const bool zeroLength = pXfer->TotalLen == 0U;
	pXfer->Started = false;

	if (USB_ENDPADDR_IS_IN(EpAddr) && zeroLength && s_Ctrlr.AddressPending)
	{
		uint32_t dcfg = NRF54_USBD_DCFG;
		dcfg &= ~NRF54_USBD_DCFG_DEVADDR_Msk;
		dcfg |= (uint32_t)s_Ctrlr.PendingAddress <<
				NRF54_USBD_DCFG_DEVADDR_Pos;
		NRF54_USBD_DCFG = dcfg;
		s_Ctrlr.AddressPending = false;
	}

	if (zeroLength)
	{
		nRF54UsbdPrimeSetup();
	}

	nRF54UsbdEmitXfer(EpAddr, total, USBD_CTRLR_XFER_SUCCESS);
}

static void nRF54UsbdCompleteData(uint8_t EpAddr)
{
	nRF54UsbdXfer_t *pXfer = nRF54UsbdGetXfer(EpAddr);
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);

	if (!pXfer->Started)
	{
		return;
	}

	uint16_t remaining;
	if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		remaining = (uint16_t)(NRF54_USBD_DIEPTSIZ(epNum) &
							  NRF54_USBD_DEPTSIZ_XFERSIZE_Msk);
	}
	else
	{
		remaining = (uint16_t)(NRF54_USBD_DOEPTSIZ(epNum) &
							  NRF54_USBD_DEPTSIZ_XFERSIZE_Msk);
	}

	const uint16_t actual = remaining <= pXfer->TotalLen ?
		(uint16_t)(pXfer->TotalLen - remaining) : 0U;

	pXfer->ActualLen = actual;
	pXfer->Started = false;
	nRF54UsbdEmitXfer(EpAddr, actual, USBD_CTRLR_XFER_SUCCESS);
}

static void nRF54UsbdBusReset(void)
{
	s_Ctrlr.HighSpeed = false;
	s_Ctrlr.AddressPending = false;
	s_Ctrlr.PendingAddress = 0U;

	uint32_t dcfg = NRF54_USBD_DCFG;
	dcfg &= ~NRF54_USBD_DCFG_DEVADDR_Msk;
	NRF54_USBD_DCFG = dcfg;

