IOsonata/IOsonata/ARM/Nordic/nRF54/src/usbd_ctrlr_nrf54.c
void UsbdCtrlrRemoteWakeup(void)
{
	NRF54_USBD_DCTL |= NRF54_USBD_DCTL_RMTWKUPSIG;
	nrfx_coredep_delay_us(2000U);
	NRF54_USBD_DCTL &= ~NRF54_USBD_DCTL_RMTWKUPSIG;
}

void UsbdCtrlrSofEnable(bool Enable)
{
	s_Ctrlr.SofEnabled = Enable;

	if (Enable)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_SOF;
		NRF54_USBD_GINTMSK |= NRF54_USBD_GINTSTS_SOF;
	}
	else
	{
		NRF54_USBD_GINTMSK &= ~NRF54_USBD_GINTSTS_SOF;
	}
}

void UsbdCtrlrSetAddress(uint8_t Address)
{
	s_Ctrlr.PendingAddress = (uint8_t)(Address & 0x7FU);
	s_Ctrlr.AddressPending = true;
}

bool UsbdCtrlrEpOpen(const UsbEndPointDesc_t *pDesc)
{
	if (!s_Ctrlr.Started || pDesc == NULL)
	{
		return false;
	}

	const uint8_t epAddr = pDesc->bEndpointAddress;
	const uint8_t epNum = USB_ENDPADDR_NUM(epAddr);
	const uint8_t type = pDesc->bmAttributes & 0x03U;
	const uint16_t mps = pDesc->wMaxPacketSize;

	if (epNum == 0U || epNum >= NRF54_USBD_EP_COUNT ||
		(type != USB_ENDPATT_TRANS_BULK &&
		 type != USB_ENDPATT_TRANS_INT) ||
		mps == 0U)
	{
		return false;
	}

	const uint16_t maxMps = type == USB_ENDPATT_TRANS_BULK ?
		(s_Ctrlr.HighSpeed ? 512U : 64U) :
		(s_Ctrlr.HighSpeed ? 1024U : 64U);
	if (mps > maxMps)
	{
		return false;
	}

	nRF54UsbdXfer_t *pXfer = nRF54UsbdGetXfer(epAddr);
	pXfer->Mps = mps;
	pXfer->Started = false;
	pXfer->ActualLen = 0U;

	const uint32_t epType =
		nRF54UsbdEpType(type) << NRF54_USBD_DEPCTL_EPTYPE_Pos;

	if (USB_ENDPADDR_IS_IN(epAddr))
	{
		if (!nRF54UsbdAllocateTxFifo(epNum, mps))
		{
			return false;
		}

		uint32_t ctl = NRF54_USBD_DIEPCTL(epNum);
		ctl &= ~(NRF54_USBD_DEPCTL_MPS_Msk |
				 NRF54_USBD_DEPCTL_EPTYPE_Msk |
				 NRF54_USBD_DIEPCTL_TXFNUM_Msk |
				 NRF54_USBD_DEPCTL_STALL);
		ctl |= mps |
			   epType |
			   NRF54_USBD_DEPCTL_USBACTEP |
			   NRF54_USBD_DEPCTL_SETD0PID |
			   ((uint32_t)epNum << NRF54_USBD_DIEPCTL_TXFNUM_Pos);
		NRF54_USBD_DIEPCTL(epNum) = ctl;
		NRF54_USBD_DAINTMSK |= NRF54_USBD_DAINT_IN(epNum);
	}
	else
	{
		if (!nRF54UsbdGrowRxFifo(mps))
		{
			return false;
		}

		uint32_t ctl = NRF54_USBD_DOEPCTL(epNum);
		ctl &= ~(NRF54_USBD_DEPCTL_MPS_Msk |
				 NRF54_USBD_DEPCTL_EPTYPE_Msk |
				 NRF54_USBD_DEPCTL_STALL);
		ctl |= mps |
			   epType |
			   NRF54_USBD_DEPCTL_USBACTEP |
			   NRF54_USBD_DEPCTL_SETD0PID;
		NRF54_USBD_DOEPCTL(epNum) = ctl;
		NRF54_USBD_DAINTMSK |= NRF54_USBD_DAINT_OUT(epNum);
	}

	return true;
}

void UsbdCtrlrEpClose(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	if (epNum == 0U || epNum >= NRF54_USBD_EP_COUNT)
	{
		return;
	}

	(void)nRF54UsbdDisableEndpoint(EpAddr, false);

	nRF54UsbdXfer_t *pXfer = nRF54UsbdGetXfer(EpAddr);
	pXfer->Started = false;
	pXfer->ActualLen = 0U;
	pXfer->TotalLen = 0U;
	pXfer->ChunkLen = 0U;
	pXfer->pBuffer = NULL;

	if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		NRF54_USBD_DAINTMSK &= ~NRF54_USBD_DAINT_IN(epNum);
	}
	else
	{
		NRF54_USBD_DAINTMSK &= ~NRF54_USBD_DAINT_OUT(epNum);
	}
}

void UsbdCtrlrEpCloseAll(void)
{
	for (uint8_t epNum = 1U; epNum < NRF54_USBD_EP_COUNT; epNum++)
	{
		UsbdCtrlrEpClose(epNum);
		UsbdCtrlrEpClose((uint8_t)(epNum | USB_ENDPADDR_DIR_IN));
	}

	(void)nRF54UsbdFlushRx();
}

bool UsbdCtrlrEpXfer(uint8_t EpAddr, uint8_t *pBuffer, uint16_t TotalBytes)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	if (!s_Ctrlr.Started || epNum >= NRF54_USBD_EP_COUNT ||
		(TotalBytes > 0U && pBuffer == NULL))
	{
		return false;
	}

	nRF54UsbdXfer_t *pXfer = nRF54UsbdGetXfer(EpAddr);
	if (pXfer->Started || pXfer->Mps == 0U)
	{
		return false;
	}

	if (epNum != 0U && TotalBytes > 0U &&
		(((uintptr_t)pBuffer & 0x3U) != 0U))
	{
		// nRF54LM20 has instruction cache only. Buffer DMA therefore needs no
		// data-cache maintenance, but the DMA address must remain word aligned.
		return false;
	}

	pXfer->pBuffer = pBuffer;
	pXfer->TotalLen = TotalBytes;
	pXfer->ActualLen = 0U;
	pXfer->ChunkLen = 0U;
	pXfer->Started = true;

	if (epNum == 0U)
	{
		return nRF54UsbdStartEp0Chunk(EpAddr);
	}

	const uint32_t packetCnt = TotalBytes == 0U ? 1U :
		((uint32_t)TotalBytes + pXfer->Mps - 1U) / pXfer->Mps;

	if (packetCnt > 0x3FFUL)
	{
		pXfer->Started = false;
		return false;
	}

	const uint32_t size =
		((uint32_t)TotalBytes & NRF54_USBD_DEPTSIZ_XFERSIZE_Msk) |
		(packetCnt << NRF54_USBD_DEPTSIZ_PKTCNT_Pos);

	if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		NRF54_USBD_DIEPDMA(epNum) = (uint32_t)(uintptr_t)pBuffer;
		NRF54_USBD_DIEPTSIZ(epNum) = size;
		NRF54_USBD_DIEPCTL(epNum) |=
			NRF54_USBD_DEPCTL_CNAK | NRF54_USBD_DEPCTL_EPENA;
	}
	else
	{
		NRF54_USBD_DOEPDMA(epNum) = (uint32_t)(uintptr_t)pBuffer;
		NRF54_USBD_DOEPTSIZ(epNum) = size;
		NRF54_USBD_DOEPCTL(epNum) |=
			NRF54_USBD_DEPCTL_CNAK | NRF54_USBD_DEPCTL_EPENA;
	}

	return true;
}

bool UsbdCtrlrEpBusy(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	return epNum < NRF54_USBD_EP_COUNT &&
		   nRF54UsbdGetXfer(EpAddr)->Started;
}

void UsbdCtrlrEpStall(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	if (epNum >= NRF54_USBD_EP_COUNT)
	{
		return;
	}

	(void)nRF54UsbdDisableEndpoint(EpAddr, true);

	// EP0 OUT remains active for SETUP reception. If the setup queue was
	// exhausted by the failed request, re-arm it without clearing STALL.
	if (epNum == 0U && !USB_ENDPADDR_IS_IN(EpAddr))
	{
		nRF54UsbdPrimeSetup();
	}
}

void UsbdCtrlrEpClearStall(uint8_t EpAddr)
{
	const uint8_t epNum = USB_ENDPADDR_NUM(EpAddr);
	if (epNum >= NRF54_USBD_EP_COUNT)
	{
		return;
	}

	if (USB_ENDPADDR_IS_IN(EpAddr))
	{
		uint32_t ctl = NRF54_USBD_DIEPCTL(epNum);
		ctl &= ~NRF54_USBD_DEPCTL_STALL;
		if (epNum != 0U)
		{
			ctl |= NRF54_USBD_DEPCTL_SETD0PID;
		}
		NRF54_USBD_DIEPCTL(epNum) = ctl;
	}
	else
	{
		uint32_t ctl = NRF54_USBD_DOEPCTL(epNum);
		ctl &= ~NRF54_USBD_DEPCTL_STALL;
		if (epNum != 0U)
		{
			ctl |= NRF54_USBD_DEPCTL_SETD0PID;
		}
		NRF54_USBD_DOEPCTL(epNum) = ctl;
	}
}

void USBHS_IRQHandler(void)
{
	const uint32_t status = NRF54_USBD_GINTSTS & NRF54_USBD_GINTMSK;
	if (status == 0U)
	{
		return;
	}

	if ((status & NRF54_USBD_GINTSTS_USBRST) != 0U)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_USBRST;
		nRF54UsbdBusReset();
	}

	if ((status & NRF54_USBD_GINTSTS_ENUMDONE) != 0U)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_ENUMDONE;
		s_Ctrlr.HighSpeed =
			(NRF54_USBD_DSTS & NRF54_USBD_DSTS_ENUMSPD_Msk) ==
			NRF54_USBD_DSTS_ENUMSPD_HS;
	}

	if ((status & NRF54_USBD_GINTSTS_OEPINT) != 0U)
	{
		nRF54UsbdOutInterrupt();
	}

	if ((status & NRF54_USBD_GINTSTS_IEPINT) != 0U)
	{
		nRF54UsbdInInterrupt();
	}

	if ((status & NRF54_USBD_GINTSTS_USBSUSP) != 0U)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_USBSUSP;
		nRF54UsbdEmitSimple(USBD_CTRLR_EVT_SUSPEND);
	}

	if ((status & NRF54_USBD_GINTSTS_WKUPINT) != 0U)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_WKUPINT;
		nRF54UsbdEmitSimple(USBD_CTRLR_EVT_RESUME);
	}

	if ((status & NRF54_USBD_GINTSTS_SOF) != 0U)
	{
		NRF54_USBD_GINTSTS = NRF54_USBD_GINTSTS_SOF;

		if (s_Ctrlr.SofEnabled)
		{
			UsbdCtrlrEvt_t evt = {
				.Type = USBD_CTRLR_EVT_SOF,
				.FrameNo = (uint16_t)((NRF54_USBD_DSTS &
									  NRF54_USBD_DSTS_FNSOF_Msk) >>
									  NRF54_USBD_DSTS_FNSOF_Pos),
			};
			nRF54UsbdEmit(&evt);
		}
	}
}
